In [1]:
import pandas as pd
import plotly.offline as pyo
import plotly.graph_objects as go
pd.options.plotting.backend = 'plotly'
import string
import nltk
from nltk.tokenize import sent_tokenize, word_tokenize
import collections

In [2]:
data_engineer = pd.read_csv('data-engineer.csv')
data_engineer.head()

,jobId,employerId,employerName,employerProfileId,employerProfileName,jobTitle,locationName,minimumSalary,maximumSalary,currency,expirationDate,date,jobDescription,applications,jobUrl,fullDescription
0,41719079,626228,Aggregator Network,NaN,NaN,Machine Learning Engineer Ref. 2148,Wembley Central,NaN,NaN,NaN,22/02/2021,11/01/2021,MI5 is responsible for protecting the UK from ...,4,https://www.reed.co.uk/jobs/machine-learning-e...,MI5 is responsible for protecting the UK from ...
1,41327452,626228,Partnership Jobs,NaN,NaN,Machine Learning Engineer Graduate Scheme,London,NaN,NaN,NaN,28/01/2021,05/11/2020,Would you love to explore a career in Data Sci...,68,https://www.reed.co.uk/jobs/machine-learning-e...,Would you love to explore a career in Data Sci...
2,41717870,626228,Aggregator Network,NaN,NaN,Consultant - Data Engineer,Belfast,NaN,NaN,NaN,22/02/2021,11/01/2021,DescriptionCME Group is the world's leading an...,1,https://www.reed.co.uk/jobs/consultant-data-en...,<b>Description</b><br />CME Group is the world...
3,41744009,626228,Aggregator Network,NaN,NaN,"Data Engineer - Hadoop, Spark, AWS/GCP",London,NaN,NaN,NaN,25/02/2021,14/01/2021,We are an international consultancy that helps...,0,https://www.reed.co.uk/jobs/data-engineer-hado...,We are an international consultancy that helps...
4,41750674,626228,Aggregator Network,NaN,NaN,Senior Data Engineer,London,NaN,NaN,NaN,25/02/2021,14/01/2021,INCLUDE: Managing a small technical team of 3...,0,https://www.reed.co.uk/jobs/senior-data-engine...,INCLUDE: <br /><ul> <li>Managing a small techn...

### Top 10 companies by the most received applications

In [3]:
data_engineer8 = data_engineer.groupby(['employerName'])['applications'].sum().sort_values(ascending = False).nlargest(n=10).reset_index()
data_engineer8

                                    employerName  applications
0                                        Harnham           705
1  Anson McCade Ltd - IT and Finance Recruitment           235
2                      Understanding Recruitment           145
3                                       X4 Group           133
4                                   Blue Pelican           109
5                            Zest Business Group           102
6                               Amber Resourcing            83
7                                 WhiteHat Group            80
8                               Partnership Jobs            76
9                                   PeopleGenius            72

In [4]:
data_engineer8[data_engineer8['employerName'] == 'WhiteHat Group']['applications'].sum()

80

### Top 10 companies by the most listed jobs

In [5]:
data_engineer9 = data_engineer['employerName'].value_counts().sort_values(ascending = False).nlargest(n=10).reset_index()
data_engineer9

                                           index  employerName
0                                        Harnham           109
1                                       X4 Group            20
2  Anson McCade Ltd - IT and Finance Recruitment            20
3                               Jefferson Frank             19
4                             Aggregator Network            19
5                               Amber Resourcing             8
6                                   Blue Pelican             8
7                      Nigel Frank International             8
8                        Michael Page Technology             8
9                                  Bond Williams             8

### The most applications received  for various job positions in companies and locations

In [6]:
data_engineer10 = data_engineer.groupby(['employerName'])['applications'].sum().sort_values(ascending = False).nlargest(n=10).reset_index()
data_engineer10

                                    employerName  applications
0                                        Harnham           705
1  Anson McCade Ltd - IT and Finance Recruitment           235
2                      Understanding Recruitment           145
3                                       X4 Group           133
4                                   Blue Pelican           109
5                            Zest Business Group           102
6                               Amber Resourcing            83
7                                 WhiteHat Group            80
8                               Partnership Jobs            76
9                                   PeopleGenius            72

In [7]:
data_engineer11 = data_engineer.groupby(['locationName'])['applications'].sum().sort_values(ascending = False).nlargest(n=10).reset_index()
data_engineer11

      locationName  applications
0           London          2217
1       Manchester           193
2            Leeds            82
3     Peterborough            81
4        Cambridge            76
5         Uxbridge            62
6           Camden            52
7           Surrey            33
8          Reading            19
9  Wembley Central            18

### Maximum average salary of top 10 companies

In [8]:
data_engineer12 = data_engineer.groupby(['employerName'])['maximumSalary'].mean().sort_values(ascending = False).nlargest(n=10).reset_index()
data_engineer12

                       employerName  maximumSalary
0                     Propel London       295000.0
1                   MFK Recruitment       140000.0
2               Revere Recruitment        110000.0
3                  Harrison Holgate       107000.0
4                 The Candidate Ltd        90000.0
5                      Zazu Digital        90000.0
6                             ADLIB        85000.0
7                  Amber Resourcing        81875.0
8  Birch & James Associates Limited        80000.0
9   Jacob Ross Talent Solutions Ltd        80000.0

### Which is the most skills required for a Data Analyst job
First check the most used words in job title and download stopwords for NLP analysis

In [9]:
! pip install nltk
nltk.download('stopwords') 
stopwords = nltk.corpus.stopwords.words('english')

Requirement already satisfied: nltk in c:\users\ghs lab pc\anaconda3\lib\site-packages (3.5)
Requirement already satisfied: click in c:\users\ghs lab pc\anaconda3\lib\site-packages (from nltk) (7.1.2)
Requirement already satisfied: regex in c:\users\ghs lab pc\anaconda3\lib\site-packages (from nltk) (2020.6.8)
Requirement already satisfied: joblib in c:\users\ghs lab pc\anaconda3\lib\site-packages (from nltk) (0.16.0)
Requirement already satisfied: tqdm in c:\users\ghs lab pc\anaconda3\lib\site-packages (from nltk) (4.47.0)

[nltk_data] Downloading package stopwords to C:\Users\GHS Lab
[nltk_data]     PC\AppData\Roaming\nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

### Set for removal words

In [10]:
remove_words = set(stopwords + list(string.punctuation) + list(string.digits))

### Check the most used words in job title

In [27]:
job_title = data_engineer[data_engineer['jobTitle'] != '-1']['jobTitle'].tolist()
list_of_words = []
for item in job_title:
    content = nltk.word_tokenize(item)
    for word in content:
        # remove unwanted words
       if word.lower() not in remove_words and word.lower() != 'data'and word.lower() != 'analyst' and word.lower() != 'data analyst':
            list_of_words.append(word.upper())

### Conver list into pandas data frame

In [12]:
list_of_words1 = pd.DataFrame({'Job Title': list_of_words}) 
list_of_words1

     Job Title
0      MACHINE
1     LEARNING
2     ENGINEER
3          REF
4         2148
...        ...
1190  ENGINEER
1191   SCIENCE
1192    SENIOR
1193  ENGINEER
1194  ENGINEER

[1195 rows x 1 columns]

### Check unique words in the above job title column

In [13]:
list_of_words1['Job Title'].unique()

array(['MACHINE', 'LEARNING', 'ENGINEER', 'REF', '2148', 'GRADUATE',
       'SCHEME', 'CONSULTANT', 'HADOOP', 'SPARK', 'AWS/GCP', 'SENIOR',
       'PRINCIPAL', 'BI', 'ANALYST/', 'ENGINEERING', 'MANAGER',
       'AUGMENTED', 'REALITY', 'COMPUTER', 'VISION', 'LEAD', 'ENGINEERS',
       'CONTRACT', 'FULLY', 'REMOTE', 'NORTHAMPTON', '£50-60K', 'HEAD',
       'WARSAW', 'BIGDATA', 'CAMBRIDGE', 'INTERVIEWING', 'TECHNICAL',
       'JAVA', 'VC', 'BACKED', 'BUSINESS', 'SQL', '£40,000', 'SSIS',
       'ETL', 'SCIENTIST', 'MARTECH', 'START', 'PYTHON', 'AIRFLOW',
       '£600', 'PD', 'MONTHS', 'IPAF', '3A/3B', 'BIG', 'GOOGLE', 'CLOUD',
       'TECH', 'START-UP', 'AZURE', 'C', '£60K', 'DATABRICKS', 'JUNIOR',
       'SC', 'DV', 'BPSS', 'CLEARED', '12', '£650', 'P/D', 'SCALA', 'HR',
       'ARCHITECT', 'LONDON', 'MARKET', 'INSURANCE', 'AWS', 'DWH', 'NLP',
       'FINTECH', 'UNICORN', '£95K', 'VOICE', 'SOFTWARE', 'CONFIGURATION',
       'DV/SC', 'TEAM', 'NATWEST', 'GROUP', 'CAREERS', 'LONDON-', 'ASSET',
       'MANAGEMENT', 'SYSTEMATIC', 'TRADING', 'HEDGE', 'FUND', 'MONGODB',
       'KAFKA', 'DOCKER', 'KUBERNETES', 'SCIENCE', 'DATABASE',
       'DEVELOPMENT', 'URGENT', 'ELASTICSEARCH', 'GCP', 'OUTSIDE', 'IR35',
       'DEVOPS', 'REDSHIFT', 'WORK', 'AVAILABLE', 'FULL', 'STACK', 'LON',
       'ELIGIBLE', 'SPECIALIST', 'PERMANENT', '£80-100,000', '100',
       'HOME', 'WORKING', 'PUBLIC', 'SECTOR', 'MANCHESTER',
       'INSTALLATION', 'FIELD', 'BASED', 'SNOWFLAKE', 'WAREHOUSE', 'CITY',
       'SECURITY', 'SYSTEMS', 'STREAM', 'PROCESSING', 'MID', 'LEVEL',
       'POWERBI', 'RELOCATION', 'OPPORTUNITY', 'FTC', 'PREM', 'MIGRATION',
       'ENGINEER/DEVELOPER', 'FIXED', 'TERM', 'WEB-SCRAPING', 'X2', 'API',
       'ONLINE', 'ENTERTAINMENT', 'RMOTE', 'OUTISIDE', 'DEVELOPER', '70K',
       '75K', 'NEGOTIABLE', 'DAY', 'RATE', 'CHINESE-MANDARIN', 'SPEAKING',
       'X', 'UK', 'WIDE', 'LEGAL', 'BACKGROUND', 'MANCHESTER/REMOTE',
       'MICROSERVICES', '45.000', 'PRESTON', '£55,000', '£60-70K',
       'EXCELLENT', 'SALARY', 'BOURNEMOUTH', 'MANAGERS', 'E-COMMERCE',
       'ANALYTICS', 'NOTTINGHAM', 'CIRCA', 'QUANTITATIVE', 'IMBEDDED',
       'BUSINE', 'MICROSOFT'], dtype=object)

### Count the top 20 most used words

In [14]:
data_engineer13 = list_of_words1['Job Title'].value_counts().sort_values(ascending = False).nlargest(n=20).reset_index()
data_engineer13

       index  Job Title
0   ENGINEER        441
1     SENIOR         92
2   LEARNING         45
3    MACHINE         45
4       LEAD         33
5         BI         29
6      AZURE         21
7        SQL         19
8     PYTHON         16
9     REMOTE         16
10       BIG         14
11       AWS         13
12    LONDON         11
13    JUNIOR         11
14     FULLY         10
15  COMPUTER         10
16        SC         10
17   SCIENCE          9
18   CLEARED          9
19      IR35          9

### Next check the most listed skills in the main data frame job title column
#### To extract name entity recognition from all job titles and save in a dictionary

In [15]:
!pip3 install https://github.com/explosion/spacy-models/releases/download/en_core_web_sm-2.3.1/en_core_web_sm-2.3.1.tar.gz
import spacy
nlp = spacy.load('en_core_web_sm')

name_entity_recognition_job_title = {}

for item in job_title:
    token = nlp(item)
    for ent in token.ents:      
        name_entity_recognition_job_title.setdefault(ent.label_ , []).append(ent.text)

Collecting https://github.com/explosion/spacy-models/releases/download/en_core_web_sm-2.3.1/en_core_web_sm-2.3.1.tar.gz
  Using cached https://github.com/explosion/spacy-models/releases/download/en_core_web_sm-2.3.1/en_core_web_sm-2.3.1.tar.gz (12.0 MB)
Requirement already satisfied (use --upgrade to upgrade): en-core-web-sm==2.3.1 from https://github.com/explosion/spacy-models/releases/download/en_core_web_sm-2.3.1/en_core_web_sm-2.3.1.tar.gz in c:\users\ghs lab pc\anaconda3\lib\site-packages
Requirement already satisfied: spacy<2.4.0,>=2.3.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from en-core-web-sm==2.3.1) (2.3.5)
Requirement already satisfied: setuptools in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (49.2.0.post20200714)
Requirement already satisfied: wasabi<1.1.0,>=0.4.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (0.8.2)
Requirement already satisfied: srsly<1.1.0,>=1.0.2 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.0.5)
Requirement already satisfied: thinc<7.5.0,>=7.4.1 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (7.4.5)
Requirement already satisfied: requests<3.0.0,>=2.13.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (2.24.0)
Requirement already satisfied: catalogue<1.1.0,>=0.0.7 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.0.0)
Requirement already satisfied: numpy>=1.15.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.18.5)
Requirement already satisfied: preshed<3.1.0,>=3.0.2 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (3.0.5)
Requirement already satisfied: cymem<2.1.0,>=2.0.2 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (2.0.5)
Requirement already satisfied: murmurhash<1.1.0,>=0.28.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.0.5)
Requirement already satisfied: plac<1.2.0,>=0.9.6 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.1.3)
Requirement already satisfied: blis<0.8.0,>=0.4.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (0.7.4)
Requirement already satisfied: tqdm<5.0.0,>=4.38.0 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (4.47.0)
Requirement already satisfied: chardet<4,>=3.0.2 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from requests<3.0.0,>=2.13.0->spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (3.0.4)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from requests<3.0.0,>=2.13.0->spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (1.25.9)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from requests<3.0.0,>=2.13.0->spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (2020.6.20)
Requirement already satisfied: idna<3,>=2.5 in c:\users\ghs lab pc\anaconda3\lib\site-packages (from requests<3.0.0,>=2.13.0->spacy<2.4.0,>=2.3.0->en-core-web-sm==2.3.1) (2.10)
Building wheels for collected packages: en-core-web-sm
  Building wheel for en-core-web-sm (setup.py): started
  Building wheel for en-core-web-sm (setup.py): finished with status 'done'
  Created wheel for en-core-web-sm: filename=en_core_web_sm-2.3.1-py3-none-any.whl size=12047114 sha256=0a81457cec01a8fa0134b68ea8da4e7fa31ec50986910fbef5f04ef4d12c6584
  Stored in directory: c:\users\ghs lab pc\appdata\local\pip\cache\wheels\ee\4d\f7\563214122be1540b5f9197b52cb3ddb9c4a8070808b22d5a84
Successfully built en-core-web-sm

In [16]:
name_entity_recognition_job_title.keys()

dict_keys(['DATE', 'ORG', 'GPE', 'MONEY', 'PERSON', 'CARDINAL', 'NORP'])

In [17]:
collections.Counter(name_entity_recognition_job_title['ORG']).most_common()

[('BI Data Engineer', 17),
 ('SQL', 6),
 ('SQL Data', 4),
 ('Machine Learning', 4),
 ('NLP', 4),
 ('Computer Vision', 4),
 ('GCP', 4),
 ('Data Engineer - Data Science', 4),
 ('Data Engineer - London - Excellent Salary', 4),
 ('ETL', 3),
 ('Data Scientist / Machine Learning Engineer - Martech', 3),
 ('AWS Data Engineer - SC Cleared / SC Eligible', 3),
 ('Data Engineer Azure /', 3),
 ('Data Engineer - Big Data', 3),
 ('SQL Data Engineer -', 2),
 ('Data Engineer / Architect', 2),
 ('Data Engineer - London', 2),
 ('AWS Data Engineer', 2),
 ('Data Engineer - SQL', 2),
 ('Lead Configuration & Data Engineer', 2),
 ('Data Engineer / Computer Science / SQL / Database', 2),
 ('BI / Data Engineer', 2),
 ('Data Engineer', 2),
 ('Data Engineer - Legal Insurance', 2),
 ('Manchester/Remote', 2),
 ('Data Engineer Python BI', 2),
 ('Data Engineer Python', 2),
 ('Snowflake Data Engineer', 2),
 ('Data Engineer - Hadoop', 1),
 ('AWS/GCP', 1),
 ('Data Engineering', 1),
 ('Senior & Lead Data Engineers', 1),
 ('Contract Data Engineers  ', 1),
 ('Data Engineering Lead', 1),
 ('Data Engineering - Warsaw', 1),
 ('Data Engineering Consultant', 1),
 ('Data Engineer - Python & Airflow', 1),
 ('Graduate / Junior Data Engineer', 1),
 ('SC', 1),
 ('DV', 1),
 ('Data Engineer - DV/SC Cleared', 1),
 ('Data Engineer Team Lead', 1),
 ('NatWest Group', 1),
 ('Data Engineer - London- Asset Management', 1),
 ('Data Engineer - Hedge Fund - London- Python', 1),
 ('DevOps Engineer - Data Engineering', 1),
 ('Python', 1),
 ('AWS', 1),
 ('RedShift', 1),
 ('SC Cleared Data Engineer', 1),
 ('Python / Data Engineer', 1),
 ('BI LONDON', 1),
 ('Data Engineer / Installation Engineer - Field', 1),
 ('Snowflake Data Engineer / Data Warehouse Engineer - City', 1),
 ('Security Systems & Data Engineer', 1),
 ('Data Engineer / ETL Developer', 1),
 ('Data Engineer / ETL Developer - Negotiable Day', 1),
 ('UK Wide', 1),
 ('GCP Data Engineer - Fully Remote', 1),
 ('Software Data Engineer - Python', 1),
 ('Java, Microservices', 1),
 ('Data Engineer BI', 1),
 ('Fintech Data Engineer', 1),
 ('BIG Data', 1),
 ('Insurance', 1),
 ('Big Data', 1),
 ('Software & Data Engineer Fully', 1),
 ('AWS  E-Commerce', 1),
 ('Data Engineer Azure', 1),
 ('Nottingham', 1),
 ('Circa', 1),
 ('SC Cleared', 1)]

In [18]:
collections.Counter(name_entity_recognition_job_title['PERSON']).most_common()

[('Lead Data Engineer', 18),
 ('Lead Data Engineer (', 4),
 ('Scala Data Engineer', 3),
 ('BPSS Cleared', 1),
 ('Scala Data', 1),
 ('Kafka', 1),
 ('Docker', 1),
 ('BI LON', 1),
 ('Preston', 1),
 ('Kafka Hadoop', 1)]

In [19]:
collections.Counter(name_entity_recognition_job_title['DATE']).most_common(10)

[('2148', 1), ('70k - 75k', 1), ('60-70k', 1)]

In [20]:
collections.Counter(name_entity_recognition_job_title['NORP']).most_common(10)

[('Chinese', 1)]

In [21]:
collections.Counter(name_entity_recognition_job_title['CARDINAL']).most_common(10)

[('100', 4), ('2', 1)]

### By viewing above, there are some useful technology skills are mentioned in the job title column
Create list of these skills

In [22]:
list_of_useful_words = ['BI', 'AWS', 'SPARK', 'SQL', 'AZURE', 'PYTHON', 'MICROSOFT']

### Next I check how many times the above skills are mentioned in the job title colum

In [23]:
count_skills_word = []
for word in list_of_words:
    if word in list_of_useful_words:
        count_skills_word.append(word)

In [24]:
list_of_words2 = pd.DataFrame({'Job Title': count_skills_word}) 
list_of_words2

    Job Title
0       SPARK
1          BI
2          BI
3         SQL
4         SQL
..        ...
96      AZURE
97      AZURE
98        AWS
99      AZURE
100     AZURE

[101 rows x 1 columns]

In [25]:
list_of_words2['Job Title'].unique()

array(['SPARK', 'BI', 'SQL', 'PYTHON', 'AZURE', 'AWS', 'MICROSOFT'],
      dtype=object)

In [26]:
data_analyst14 = list_of_words2['Job Title'].value_counts().sort_values(ascending = False).nlargest(n=20).reset_index()
data_analyst14

       index  Job Title
0         BI         29
1      AZURE         21
2        SQL         19
3     PYTHON         16
4        AWS         13
5      SPARK          2
6  MICROSOFT          1